Revit 2024 API
FreeFormElement.UpdateSolidGeometry Method
 Updates the geometry of the FreeForm element to the given shape preserving References to the existing geometry where possible (see remarks for rules).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void UpdateSolidGeometry(
	Solid newGeometry
)
Visual Basic
Public Sub UpdateSolidGeometry ( _
	newGeometry As Solid _
)
Visual C++
public:
void UpdateSolidGeometry(
	Solid^ newGeometry
)
Parameters
newGeometry
Type: Autodesk.Revit.DB.Solid
 The new geometry to set in the FreeForm element.
Remarks
 Rules for preserving References:
First preserve faces as Reference when exclusively coincident with existing faces.
Then preserve faces as Reference if exclusively parallel to existing faces.
Then preserve faces as Reference if exclusive at small angle to the existing faces.
Any other faces are will not be preserved as a Reference.
 Edges are preserved as References if and only if exclusively bound to faces that are also preserved as References.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FreeFormElement Class
Autodesk.Revit.DB Namespace